// 1、使用数组存储不同类型的数据
// 2、使用方括号访问数组的元素
// 3、使用 .push() 方法来添加元素 push(1,2,3) 方法接受任意数量的参数，并将这些参数添加到数组的末尾。
// 4、使用 .unshift() 方法来添加元素 unshift(1,2,3) 方法接受任意数量的参数，并将这些参数添加到数组的开头。
// 5、使用 .pop() 方法来删除元素 pop() 方法删除数组的最后一个元素，并返回该元素。
// 6、使用 .shift() 方法来删除元素 shift() 方法删除数组的第一个元素，并返回该元素。
// 7、使用 .splice() 方法来删除元素 splice(1,2) 方法删除数组中从索引 1 开始的 2 个元素，并返回被删除的元素。
// 8、使用 splice() 添加元素 splice(1,0,1,2) 方法在索引 1 处删除0个，添加 2 个元素，并返回被删除的元素。
// 9、 slice() 不会修改数组，而是会复制，或者说*取（extract）给定数量的元素到一个新数组。slice() 只接收 2 个输入参数：第一个是开始提取元素的位置（索引），第二个是提取元素的结束位置（索引），包含第一个但不包含第二个。
